In [1]:
import numpy as np
import pandas as pd

In [2]:
rand_mat = np.random.randn(5,4)
rand_mat

array([[ 1.5633145 , -0.31285036,  0.87478507,  0.12504477],
       [-1.05640926, -0.00582228,  1.24539579, -1.57195948],
       [ 0.50491881, -0.60622197, -1.74195815, -0.72476432],
       [ 0.45063669,  1.2201413 ,  0.17104031, -1.18374347],
       [ 0.30930653,  0.01022717, -0.55207622, -0.80084596]])

In [3]:
df = pd.DataFrame(rand_mat, index=['A','B','C','D','E'],columns='W X Y Z'.split())

In [4]:
df

          W         X         Y         Z
A  1.563315 -0.312850  0.874785  0.125045
B -1.056409 -0.005822  1.245396 -1.571959
C  0.504919 -0.606222 -1.741958 -0.724764
D  0.450637  1.220141  0.171040 -1.183743
E  0.309307  0.010227 -0.552076 -0.800846

In [5]:
type(df)

pandas.core.frame.DataFrame

In [6]:
df.loc['A']

W    1.563315
X   -0.312850
Y    0.874785
Z    0.125045
Name: A, dtype: float64

In [7]:
type(df.loc['A'])

pandas.core.series.Series

### Selection and Indexing

In [8]:
df.loc['A']

W    1.563315
X   -0.312850
Y    0.874785
Z    0.125045
Name: A, dtype: float64

In [9]:
df.iloc[0]

W    1.563315
X   -0.312850
Y    0.874785
Z    0.125045
Name: A, dtype: float64

In [10]:
df['W']

A    1.563315
B   -1.056409
C    0.504919
D    0.450637
E    0.309307
Name: W, dtype: float64

In [11]:
df[['W','Z']]

          W         Z
A  1.563315  0.125045
B -1.056409 -1.571959
C  0.504919 -0.724764
D  0.450637 -1.183743
E  0.309307 -0.800846

In [12]:
type(df[['W','Z']])

pandas.core.frame.DataFrame

In [13]:
df

          W         X         Y         Z
A  1.563315 -0.312850  0.874785  0.125045
B -1.056409 -0.005822  1.245396 -1.571959
C  0.504919 -0.606222 -1.741958 -0.724764
D  0.450637  1.220141  0.171040 -1.183743
E  0.309307  0.010227 -0.552076 -0.800846

In [14]:
df['New'] = df['W']+df['Y']

In [15]:
df

          W         X         Y         Z       New
A  1.563315 -0.312850  0.874785  0.125045  2.438100
B -1.056409 -0.005822  1.245396 -1.571959  0.188987
C  0.504919 -0.606222 -1.741958 -0.724764 -1.237039
D  0.450637  1.220141  0.171040 -1.183743  0.621677
E  0.309307  0.010227 -0.552076 -0.800846 -0.242770

In [18]:
df.drop('New',axis=1,inplace=True)

In [19]:
df

          W         X         Y         Z
A  1.563315 -0.312850  0.874785  0.125045
B -1.056409 -0.005822  1.245396 -1.571959
C  0.504919 -0.606222 -1.741958 -0.724764
D  0.450637  1.220141  0.171040 -1.183743
E  0.309307  0.010227 -0.552076 -0.800846

### Adding a Row

In [20]:
df.loc['F'] = df.loc['A']+df.loc['B']

In [21]:
df

          W         X         Y         Z
A  1.563315 -0.312850  0.874785  0.125045
B -1.056409 -0.005822  1.245396 -1.571959
C  0.504919 -0.606222 -1.741958 -0.724764
D  0.450637  1.220141  0.171040 -1.183743
E  0.309307  0.010227 -0.552076 -0.800846
F  0.506905 -0.318673  2.120181 -1.446915

In [22]:
df.drop('F',axis=0,inplace=True)

In [23]:
df

          W         X         Y         Z
A  1.563315 -0.312850  0.874785  0.125045
B -1.056409 -0.005822  1.245396 -1.571959
C  0.504919 -0.606222 -1.741958 -0.724764
D  0.450637  1.220141  0.171040 -1.183743
E  0.309307  0.010227 -0.552076 -0.800846

In [24]:
df.loc['F'] = df.loc['A']+df.loc['B']

In [25]:
df

          W         X         Y         Z
A  1.563315 -0.312850  0.874785  0.125045
B -1.056409 -0.005822  1.245396 -1.571959
C  0.504919 -0.606222 -1.741958 -0.724764
D  0.450637  1.220141  0.171040 -1.183743
E  0.309307  0.010227 -0.552076 -0.800846
F  0.506905 -0.318673  2.120181 -1.446915

In [26]:
newind = 'DEL UP UK TN AP KL'.split()

In [27]:
newind

['DEL', 'UP', 'UK', 'TN', 'AP', 'KL']

In [28]:
df['States'] = newind

In [29]:
df

          W         X         Y         Z States
A  1.563315 -0.312850  0.874785  0.125045    DEL
B -1.056409 -0.005822  1.245396 -1.571959     UP
C  0.504919 -0.606222 -1.741958 -0.724764     UK
D  0.450637  1.220141  0.171040 -1.183743     TN
E  0.309307  0.010227 -0.552076 -0.800846     AP
F  0.506905 -0.318673  2.120181 -1.446915     KL

In [30]:
df.reset_index()

  index         W         X         Y         Z States
0     A  1.563315 -0.312850  0.874785  0.125045    DEL
1     B -1.056409 -0.005822  1.245396 -1.571959     UP
2     C  0.504919 -0.606222 -1.741958 -0.724764     UK
3     D  0.450637  1.220141  0.171040 -1.183743     TN
4     E  0.309307  0.010227 -0.552076 -0.800846     AP
5     F  0.506905 -0.318673  2.120181 -1.446915     KL

In [31]:
df.set_index('States',inplace=True)

In [32]:
df

               W         X         Y         Z
States
DEL     1.563315 -0.312850  0.874785  0.125045
UP     -1.056409 -0.005822  1.245396 -1.571959
UK      0.504919 -0.606222 -1.741958 -0.724764
TN      0.450637  1.220141  0.171040 -1.183743
AP      0.309307  0.010227 -0.552076 -0.800846
KL      0.506905 -0.318673  2.120181 -1.446915

#### Multi-Index Levels

In [33]:
outside = ['North', 'North', 'North', 'South', 'South', 'South']
inside = newind

In [34]:
hier_index = list(zip(outside,inside))

In [35]:
hier_index

[('North', 'DEL'),
 ('North', 'UP'),
 ('North', 'UK'),
 ('South', 'TN'),
 ('South', 'AP'),
 ('South', 'KL')]

In [37]:
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [38]:
hier_index

MultiIndex([('North', 'DEL'),
            ('North',  'UP'),
            ('North',  'UK'),
            ('South',  'TN'),
            ('South',  'AP'),
            ('South',  'KL')],
           )

In [39]:
df.index = hier_index

In [40]:
df

                  W         X         Y         Z
North DEL  1.563315 -0.312850  0.874785  0.125045
      UP  -1.056409 -0.005822  1.245396 -1.571959
      UK   0.504919 -0.606222 -1.741958 -0.724764
South TN   0.450637  1.220141  0.171040 -1.183743
      AP   0.309307  0.010227 -0.552076 -0.800846
      KL   0.506905 -0.318673  2.120181 -1.446915

In [41]:
df.xs('North')

            W         X         Y         Z
DEL  1.563315 -0.312850  0.874785  0.125045
UP  -1.056409 -0.005822  1.245396 -1.571959
UK   0.504919 -0.606222 -1.741958 -0.724764

### Data Input & Output

### CSV Input

In [42]:
df = pd.read_csv('C:\\Users\\AEL04\\Downloads\\example.csv')

In [43]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [44]:
df2 = pd.read_csv('C:/Users/AEL04/Downloads/example.csv')

In [45]:
df2

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [46]:
pwd

'C:\\Users\\AEL04'

In [47]:
df3 = pd.read_csv('example.csv')

In [48]:
pd.

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [52]:
df3.to_csv('example3.csv',index=False)

In [53]:
df4 = pd.read_csv('example3.csv')

In [54]:
df4

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

#### Excel Input

In [55]:
df = pd.read_excel('Excel_Sample.xlsx',sheet_name='Sheet1')

In [56]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [57]:
df.to_excel('Excel_Sample2.xlsx',sheet_name='Sheet1',index=False)

In [59]:
pd.read_csv('population_india_census2011.csv',encoding='unicode_escape')

,Sno,Region,State / Union Territory,Population,Rural population,Urban population,Area,Gender Ratio
0,1,North,Uttar Pradesh,199812341,155317278,44495063,"240,928 km2",912
1,2,West,Maharashtra,112374333,61556074,50818259,"307,713 km2",929
2,3,North,Bihar,104099452,92341436,11758016,"94,163 km2",918
3,4,East,West Bengal,91276115,62183113,29093002,"88,752 km2",953
4,5,Cntral,Madhya Pradesh,72626809,52557404,20069405,"308,245 km2",931
5,6,South,Tamil Nadu,72147030,37229590,34917440,"130,058 km2",996
6,7,North,Rajasthan,68548437,51500352,17048085,"342,239 km2",928
7,8,South,Karnataka,61095297,37469335,23625962,"191,791 km2",973
8,9,West,Gujarat,60439692,34694609,25745083,"196,024 km2",919
9,10,South,Andhra Pradesh,49577103,34966693,14610410,"162,968 km2",993
10,11,East,Odisha,41974218,34970562,7003656,"155,707 km2",979
11,12,South,Telengana,35003674,21395009,13608665,"112,077 km2",988
12,13,South,Kerala,33406061,17471135,15934926,"38,863 km2",1084
13,14,Central,Jharkhand,32988134,25055073,7933061,"79,714 km2",948
14,15,Noth East,Assam,31205576,26807034,4398542,"78,438 km2",954
15,16,North,Punjab,27743338,17344192,10399146,"50,362 km2",895
16,17,Central,Chhattisgarh,25545198,19607961,5937237,"135,191 km2",991
17,18,North,Haryana,25351462,16509359,8842103,"44,212 km2",879
18,19,North,Uttarakhand,10086292,7036954,3049338,"53,483 km2",963
19,20,North,Himachal Pradesh,6864602,6176050,688552,"55,673 km2",972
20,21,Noth East,Tripura,3673917,2712464,961453,"10,486 km2",960
21,22,Noth East,Meghalaya,2966889,2371439,595450,"22,429 km2",989
22,23,Noth East,Manipur,2570390,1793875,776515,"22,327 km2",992
23,24,Noth East,Nagaland,1978502,1407536,570966,"16,579 km2",931
24,25,West,Goa,1458545,551731,906814,"3,702 km2",973
25,26,Noth East,Arunachal Pradesh,1383727,1066358,317369,"83,743 km2",938
26,27,Noth East,Mizoram,1097206,525435,571771,"21,081 km2",976
27,28,Noth East,Sikkim,610577,456999,153578,"7,096 km2",890
28,29,North,Delhi,16787941,419042,16368899,"1,484 km2",868
29,30,North,Jammu and Kashmir,12267032,9064220,3202812,"125,535 km2",890
30,31,South,Puducherry,1247953,395200,852753,479 km2,1037
31,32,North,Chandigarh,1055450,28991,1026459,114 km2,818
32,33,West,Dadra and Nagar Haveli and Daman and Diu,585764,243510,342254,603 km2,711
33,34,South,Andaman and Nicobar Islands,380581,237093,143488,"8,249 km2",876
34,35,North,Ladakh,274000,43840,230160,"96,701 km2",853
35,36,South,Lakshadweep,64473,14141,50332,32 km2,946

In [60]:
df = pd.read_csv('https://raw.githubusercontent.com/ishant707/Covid19/master/covid_19_world.csv')

In [64]:
df.head(10)

,SNo,ObservationDate,Province/State,Country/Region,Last Update,Confirmed,Deaths,Recovered
0,1,01/22/2020,Anhui,Mainland China,1/22/2020 17:00,1.0,0.0,0.0
1,2,01/22/2020,Beijing,Mainland China,1/22/2020 17:00,14.0,0.0,0.0
2,3,01/22/2020,Chongqing,Mainland China,1/22/2020 17:00,6.0,0.0,0.0
3,4,01/22/2020,Fujian,Mainland China,1/22/2020 17:00,1.0,0.0,0.0
4,5,01/22/2020,Gansu,Mainland China,1/22/2020 17:00,0.0,0.0,0.0
5,6,01/22/2020,Guangdong,Mainland China,1/22/2020 17:00,26.0,0.0,0.0
6,7,01/22/2020,Guangxi,Mainland China,1/22/2020 17:00,2.0,0.0,0.0
7,8,01/22/2020,Guizhou,Mainland China,1/22/2020 17:00,1.0,0.0,0.0
8,9,01/22/2020,Hainan,Mainland China,1/22/2020 17:00,4.0,0.0,0.0
9,10,01/22/2020,Hebei,Mainland China,1/22/2020 17:00,1.0,0.0,0.0

In [62]:
df.shape

(48095, 8)

In [63]:
df.tail()

,SNo,ObservationDate,Province/State,Country/Region,Last Update,Confirmed,Deaths,Recovered
48090,48091,06/22/2020,Zacatecas,Mexico,2020-06-23 04:33:22,706.0,75.0,442.0
48091,48092,06/22/2020,Zakarpattia Oblast,Ukraine,2020-06-23 04:33:22,2188.0,57.0,842.0
48092,48093,06/22/2020,Zaporizhia Oblast,Ukraine,2020-06-23 04:33:22,555.0,16.0,391.0
48093,48094,06/22/2020,Zhejiang,Mainland China,2020-06-23 04:33:22,1269.0,1.0,1267.0
48094,48095,06/22/2020,Zhytomyr Oblast,Ukraine,2020-06-23 04:33:22,1270.0,23.0,633.0